# CROSS TABULATION ON `adultKNN` DATA

###### - Importing Pandas Library

In [35]:
import pandas as pd

###### - Reading csv File

In [36]:
ak = pd.read_csv("adultKNN.csv")
ak.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

###### - Checking for the size of data

In [37]:
ak.shape

(48842, 15)

- > The Data contains Null values in for of ?

### Replacing " ? " to np.nan (i.e Null Values)

###### - Importing Numpy Library

In [38]:
import numpy as np

###### - Replacing " ? " to np.nan

In [39]:
ak.replace({"?":np.nan}, inplace = True)

# CROSS TABULATION

In [40]:
pd.crosstab(ak.gender,ak.income)

income  <=50K  >50K
gender
Female  14423  1769
Male    22732  9918

In [41]:
print(14423/(14423+1769)*100,"% of Females have income less than 50K")
print(1769/(14423+1769)*100,"% of Females have income greater than 50K")

print(22732/(22732+9918)*100,"% of Males have income less than 50K")
print(9918/(22732+9918)*100,"% of Maless have income greater than 50K")

89.07485177865613 % of Females have income less than 50K
10.925148221343873 % of Females have income greater than 50K
69.62327718223584 % of Males have income less than 50K
30.37672281776417 % of Maless have income greater than 50K

In [42]:
pd.crosstab(ak.age >= round(ak.age.max() / 2) ,ak.income)

income  <=50K  >50K
age
False   26935  6267
True    10220  5420

In [43]:
print(26935 / (26935+6267) * 100,"% of peoples age is less than", round(ak.age.max() / 2), "whose salary is less than 50K")
print(6267 / (26935+6267) * 100,"% of peoples age is less than " ,round(ak.age.max() / 2), " whose salary is greater than 50K")
print(26935 / (26935+6267) * 100,"% of peoples age is greater than equal to" ,round(ak.age.max() / 2), "whose salary is less than 50K")
print(6267 / (26935+6267) * 100,"% of peoples age is greater than equal to ", round(ak.age.max() / 2), " whose salary is greater than 50K")

81.12463104632252 % of peoples age is less than 45 whose salary is less than 50K
18.87536895367749 % of peoples age is less than  45  whose salary is greater than 50K
81.12463104632252 % of peoples age is greater than equal to 45 whose salary is less than 50K
18.87536895367749 % of peoples age is greater than equal to  45  whose salary is greater than 50K

###### - Cross-Tabulation On all The Columns

In [44]:
ak.head(2)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K

###### - Cross-Tabulation on all columns

In [45]:
x = ak.iloc[:,0:-1]
y = ak.iloc[:,-1]
col = x.select_dtypes(include = 'object').columns

for i in col:
    print("Cross Tabulation on ",i,"& income")
    print("   ")
    print(pd.crosstab(x[i],ak["income"]))
    print("    ")

Cross Tabulation on  workclass & income

income            <=50K  >50K
workclass
Federal-gov         871   561
Local-gov          2209   927
Never-worked         10     0
Private           26519  7387
Self-emp-inc        757   938
Self-emp-not-inc   2785  1077
State-gov          1451   530
Without-pay          19     2

Cross Tabulation on  education & income

income        <=50K  >50K
education
10th           1302    87
11th           1720    92
12th            609    48
1st-4th         239     8
5th-6th         482    27
7th-8th         893    62
9th             715    41
Assoc-acdm     1188   413
Assoc-voc      1539   522
Bachelors      4712  3313
Doctorate       163   431
HS-grad       13281  2503
Masters        1198  1459
Preschool        82     1
Prof-school     217   617
Some-college   8815  2063

Cross Tabulation on  marital-status & income

income                 <=50K  >50K
marital-status
Divorced                5962   671
Married-AF-spouse         23    14
Married-civ-spouse     12395  9984
Married-spouse-absent    570    58
Never-married          15384   733
Separated               1431    99
Widowed                 1390   128

Cross Tabulation on  occupation & income

income             <=50K  >50K
occupation
Adm-clerical        4843   768
Armed-Forces          10     5
Craft-repair        4729  1383
Exec-managerial     3178  2908
Farming-fishing     1317   173
Handlers-cleaners   1934   138
Machine-op-inspct   2650   372
Other-service       4719   204
Priv-house-serv      239     3
Prof-specialty      3388  2784
Protective-serv      675   308
Sales               4029  1475
Tech-support        1026   420
Transport-moving    1874   481

Cross Tabulation on  relationship & income

income          <=50K  >50K
relationship
Husband         10870  8846
Not-in-family   11307  1276
Other-relative   1454    52
Own-child        7470   111
Unmarried        4816   309
Wife             1238  1093

Cross Tabulation on  race & income

income              <=50K   >50K
race
Amer-Indian-Eskimo    415     55
Asian-Pac-Islander   1110    409
Black                4119    566
Other                 356     50
White               31155  10607

Cross Tabulation on  gender & income

income  <=50K  >50K
gender
Female  14423  1769
Male    22732  9918

Cross Tabulation on  native-country & income

income                      <=50K   >50K
native-country
Cambodia                       19      9
Canada                        119     63
China                          86     36
Columbia                       81      4
Cuba                          104     34
Dominican-Republic             98      5
Ecuador                        39      6
El-Salvador                   144     11
England                        80     47
France                         22     16
Germany                       148     58
Greece                         31     18
Guatemala                      85      3
Haiti                          66      9
Holand-Netherlands              1      0
Honduras                       18      2
Hong                           22      8
Hungary                        13      6
India                          89     62
Iran                           37     22
Ireland                        26     11
Italy                          71     34
Jamaica                        91     15
Japan                          60     32
Laos                           21      2
Mexico                        904     47
Nicaragua                      46      3
Outlying-US(Guam-USVI-etc)     22      1
Peru                           42      4
Philippines                   210     85
Poland                         70     17
Portugal                       55     12
Puerto-Rico                   164     20
Scotland                       18      3
South                          95     20
Taiwan                         39     26
Thailand                       25      5
Trinadad&Tobago                25      2
United-States               33138  10694
Vietnam                        79      7
Yugoslavia                     15      8